In [1]:
# here I import libraries that I'm gonna use

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
# Read the three files into python as dataframes

In [5]:
file1 = pd.read_csv('file1.csv')

In [6]:
file2 = pd.read_csv('file2.csv')

In [7]:
file3 = pd.read_csv('file3.csv')

In [8]:
# Show the DataFrame's shape.

In [9]:
file1.shape

(4008, 11)

In [10]:
file2.shape

(996, 11)

In [11]:
file3.shape

(7070, 11)

In [12]:
file1.head(1)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934

In [13]:
# Standardize header names.

In [14]:
# Here I change capital letter to lower letter and replace all blank space by _

In [15]:
cols = [col_name.lower().replace(' ', '_') for col_name in file1.columns]

In [16]:
cols

['customer',
 'st',
 'gender',
 'education',
 'customer_lifetime_value',
 'income',
 'monthly_premium_auto',
 'number_of_open_complaints',
 'policy_type',
 'vehicle_class',
 'total_claim_amount']

In [17]:
file1.columns = cols

In [18]:
file1.head(1)

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934

In [19]:
file1 = file1.rename(columns={"st":"state"})

In [20]:
file1.head(1)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934

In [21]:
file1.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [22]:
data1=file1.columns

In [23]:
data1

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [24]:
data11=file1[data1]

In [25]:
data11.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [26]:
# If you run that one twice you get an error because the changes have already been made.
# But just below is the line that would remove the % and keep the value. because it was percentage I multiply by 100

data11['customer_lifetime_value'] = data11['customer_lifetime_value'].str.rstrip("%").astype(float)*100

In [27]:
data11.head(3)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,69795359.0,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,128874317.0,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247

In [28]:
file2.head(3)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car

In [29]:
cols2 = [col_name.lower().replace(' ', '_') for col_name in file2.columns]

In [30]:
cols2

['customer',
 'st',
 'gender',
 'education',
 'customer_lifetime_value',
 'income',
 'monthly_premium_auto',
 'number_of_open_complaints',
 'total_claim_amount',
 'policy_type',
 'vehicle_class']

In [31]:
file2.columns = cols2

In [32]:
file2.head(3)

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car

In [33]:
file2 = file2.rename(columns={"st":"state"})

In [34]:
file2.head(1)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car

In [35]:
file2.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'total_claim_amount', 'policy_type', 'vehicle_class'],
      dtype='object')

In [36]:
data2=file2.columns

In [37]:
data2

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'total_claim_amount', 'policy_type', 'vehicle_class'],
      dtype='object')

In [38]:
data12=file2[data2]

In [39]:
data12.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,1027.2,Personal Auto,Luxury Car
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,451.2,Corporate Auto,Two-Door Car

In [40]:
data12['customer_lifetime_value'] = data12['customer_lifetime_value'].str.rstrip("%").astype(float)*100

In [41]:
data12.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,32391247.0,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,46268011.0,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,89970402.0,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,258070630.0,71210,214,1/1/00,1027.2,Personal Auto,Luxury Car
4,WH52799,Arizona,F,College,38081221.0,94903,94,1/0/00,451.2,Corporate Auto,Two-Door Car

In [42]:
file3.head(1)

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.2,Two-Door Car

In [43]:
cols3 = [col_name.lower().replace(' ', '_') for col_name in file3.columns]

In [44]:
cols3

['customer',
 'state',
 'customer_lifetime_value',
 'education',
 'gender',
 'income',
 'monthly_premium_auto',
 'number_of_open_complaints',
 'policy_type',
 'total_claim_amount',
 'vehicle_class']

In [45]:
file3.columns = cols3

In [46]:
file3.head(1)

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.2,Two-Door Car

In [47]:
file3.columns

Index(['customer', 'state', 'customer_lifetime_value', 'education', 'gender',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'total_claim_amount', 'vehicle_class'],
      dtype='object')

In [48]:
data3=file3.columns

In [49]:
data3

Index(['customer', 'state', 'customer_lifetime_value', 'education', 'gender',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'total_claim_amount', 'vehicle_class'],
      dtype='object')

In [50]:
data13=file3[data3]

In [51]:
data13.head(1)

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.2,Two-Door Car

In [53]:
data13.head(1)

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.2,Two-Door Car

In [ ]:
# Rearrange the columns in the dataframe as needed

In [54]:
data11 = data11[['customer',
 'state',
 'customer_lifetime_value',
 'education',
 'gender',
 'income',
 'monthly_premium_auto',
 'number_of_open_complaints',
 'policy_type',
 'total_claim_amount',
 'vehicle_class']]

In [55]:
data12 = data12[['customer',
 'state',
 'customer_lifetime_value',
 'education',
 'gender',
 'income',
 'monthly_premium_auto',
 'number_of_open_complaints',
 'policy_type',
 'total_claim_amount',
 'vehicle_class']]

In [56]:
data13 = data13[['customer',
 'state',
 'customer_lifetime_value',
 'education',
 'gender',
 'income',
 'monthly_premium_auto',
 'number_of_open_complaints',
 'policy_type',
 'total_claim_amount',
 'vehicle_class']]

In [57]:
data11.head(2)

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,2.704934,Four-Door Car
1,QZ44356,Arizona,69795359.0,Bachelor,F,0.0,94.0,1/0/00,Personal Auto,1131.464935,Four-Door Car

In [58]:
data12.head(1)

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,GS98873,Arizona,32391247.0,Bachelor,F,16061,88,1/0/00,Personal Auto,633.6,Four-Door Car

In [59]:
data11.head(3)

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,2.704934,Four-Door Car
1,QZ44356,Arizona,69795359.0,Bachelor,F,0.0,94.0,1/0/00,Personal Auto,1131.464935,Four-Door Car
2,AI49188,Nevada,128874317.0,Bachelor,F,48767.0,108.0,1/0/00,Personal Auto,566.472247,Two-Door Car

In [60]:
# Concatenate the three dataframes

In [61]:
dataf = pd.concat([data11, data12, data13])

In [63]:
dataf.head(1)

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,2.704934,Four-Door Car

In [64]:
data11.shape

(4008, 11)

In [65]:
data12.shape

(996, 11)

In [66]:
data13.shape

(7070, 11)

In [67]:
dataf.shape

(12074, 11)

In [ ]:
# cheking types of data

In [70]:
dataf.dtypes

customer                      object
state                         object
customer_lifetime_value      float64
education                     object
gender                        object
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
total_claim_amount           float64
vehicle_class                 object
dtype: object

In [ ]:
# Which columns are numerical?

In [72]:
dataf.select_dtypes(include=["float64"]).columns  # gives the information of which are numerical

Index(['customer_lifetime_value', 'income', 'monthly_premium_auto',
       'total_claim_amount'],
      dtype='object')

In [78]:
dataf.select_dtypes(include=np.number)  # show a sibset of the dataframe countening only numerical columns

,customer_lifetime_value,income,monthly_premium_auto,total_claim_amount
0,NaN,0.0,1000.0,2.704934
1,6.979536e+07,0.0,94.0,1131.464935
2,1.288743e+08,48767.0,108.0,566.472247
3,7.645862e+07,0.0,106.0,529.881344
4,5.363076e+07,36357.0,68.0,17.269323
...,...,...,...,...
7065,2.340599e+04,71941.0,73.0,198.234764
7066,3.096511e+03,21604.0,79.0,379.200000
7067,8.163890e+03,0.0,85.0,790.784983
7068,7.524442e+03,21941.0,96.0,691.200000
7069,2.611837e+03,0.0,77.0,369.600000

In [ ]:
# Which columns are categorical?

In [73]:
dataf.select_dtypes(include=["object"]).columns

Index(['customer', 'state', 'education', 'gender', 'number_of_open_complaints',
       'policy_type', 'vehicle_class'],
      dtype='object')

In [ ]:
#Understand the meaning of all columns

In [77]:
dataf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12074 entries, 0 to 7069
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9137 non-null   object
 1   state                      9137 non-null   object
 2   customer_lifetime_value    9130 non-null   float64
 3   education                  9137 non-null   object
 4   gender                     9015 non-null   object
 5   income                     9137 non-null   float64
 6   monthly_premium_auto       9137 non-null   float64
 7   number_of_open_complaints  9137 non-null   object
 8   policy_type                9137 non-null   object
 9   total_claim_amount         9137 non-null   float64
 10  vehicle_class              9137 non-null   object
dtypes: float64(4), object(7)
memory usage: 1.1+ MB

In [74]:
# Perform the data cleaning operations mentioned so far in class

In [75]:
# Delete the column education and the number of open complaints from the dataframe.

In [79]:
del dataf["education"]

#dataf = dataf.drop(["number_of_open_complaints"], axis = 1)  would also work, difference between the 2 is that
# with del dataf I change dataf for good when using the second one return a data frame without modifying dataf

In [80]:
dataf.head(1)

,customer,state,customer_lifetime_value,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,RB50392,Washington,NaN,NaN,0.0,1000.0,1/0/00,Personal Auto,2.704934,Four-Door Car

In [82]:
del dataf["number_of_open_complaints"]

In [84]:
dataf.head(1)

,customer,state,customer_lifetime_value,gender,income,monthly_premium_auto,policy_type,total_claim_amount,vehicle_class
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,2.704934,Four-Door Car

In [ ]:
#Correct the values in the column customer lifetime value. They are given as a percent, 
#so multiply them by 100 and change dtype to numerical type.

# already done above

In [ ]:
# Check for duplicate rows in the data and remove if any.

In [97]:
dataf[dataf.duplicated()== False]

,customer,state,customer_lifetime_value,gender,income,monthly_premium_auto,policy_type,total_claim_amount,vehicle_class
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,2.704934,Four-Door Car
1,QZ44356,Arizona,6.979536e+07,F,0.0,94.0,Personal Auto,1131.464935,Four-Door Car
2,AI49188,Nevada,1.288743e+08,F,48767.0,108.0,Personal Auto,566.472247,Two-Door Car
3,WW63253,California,7.645862e+07,M,0.0,106.0,Corporate Auto,529.881344,SUV
4,GA49547,Washington,5.363076e+07,M,36357.0,68.0,Personal Auto,17.269323,Four-Door Car
...,...,...,...,...,...,...,...,...,...
7065,LA72316,California,2.340599e+04,M,71941.0,73.0,Personal Auto,198.234764,Four-Door Car
7066,PK87824,California,3.096511e+03,F,21604.0,79.0,Corporate Auto,379.200000,Four-Door Car
7067,TD14365,California,8.163890e+03,M,0.0,85.0,Corporate Auto,790.784983,Four-Door Car
7068,UP19263,California,7.524442e+03,M,21941.0,96.0,Personal Auto,691.200000,Four-Door Car
7069,Y167826,California,2.611837e+03,M,0.0,77.0,Corporate Auto,369.600000,Two-Door Car

In [98]:
# Filter out the data for customers who have an income of 0 or less.

In [99]:
dataf[dataf["income"] <= 0]

,customer,state,customer_lifetime_value,gender,income,monthly_premium_auto,policy_type,total_claim_amount,vehicle_class
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,2.704934,Four-Door Car
1,QZ44356,Arizona,6.979536e+07,F,0.0,94.0,Personal Auto,1131.464935,Four-Door Car
3,WW63253,California,7.645862e+07,M,0.0,106.0,Corporate Auto,529.881344,SUV
7,CF85061,Arizona,7.216100e+07,M,0.0,101.0,Corporate Auto,363.029680,Four-Door Car
10,SX51350,California,4.738992e+07,M,0.0,67.0,Personal Auto,482.400000,Four-Door Car
...,...,...,...,...,...,...,...,...,...
7059,WZ45103,California,5.678050e+03,F,0.0,76.0,Personal Auto,364.800000,Four-Door Car
7061,RX91025,California,1.987226e+04,M,0.0,185.0,Personal Auto,1950.725547,SUV
7062,AC13887,California,4.628995e+03,M,0.0,67.0,Corporate Auto,482.400000,Two-Door Car
7067,TD14365,California,8.163890e+03,M,0.0,85.0,Corporate Auto,790.784983,Four-Door Car
7069,Y167826,California,2.611837e+03,M,0.0,77.0,Corporate Auto,369.600000,Two-Door Car